{
  "selectedTemplate": 1,
  "headings": {
    "work": "Experience",
    "education": "Education",
    "skills": "Skills"
  },
  "basics": {
    "name": "Sydney R. Lin",
    "email": "sydney.lin12@gmail.com",
    "phone": "(785) 979-4932",
    "location": {
      "address": "Seattle, WA"
    },
    "website": "https://www.linkedin.com/in/sydneylin12/"
  },
  "education": [
    {
      "institution": "University of Minnesota, Twin Cities",
      "location": "Minneapolis, MN",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "Aug 2017",
      "endDate": "Dec 2020"
    }
  ],
  "work": [
    {
      "company": "Flexport",
      "location": "Bellevue, WA",
      "position": "Software Engineer II",
      "website": "https://www.linkedin.com/in/sydneylin12/",
      "startDate": "Oct 2024",
      "highlights": [
        "Designed a generic automation framework to resolve work items by sending outbound chasing messages.",
        "Led development on a container demurrage alert system, saving Flexport $50 per container daily by reducing shipment delays.",
        "Streamlined Flexport's operations in Asia by implementing a scalable, region-specific work item configuration for 11 tasks."
      ],
      "endDate": "Present"
    },
    {
      "company": "Amazon Web Services (AWS)",
      "location": "Seattle, WA",
      "position": "Software Development Engineer II",
      "website": "https://www.linkedin.com/in/sydneylin12/",
      "startDate": "Mar 2024",
      "highlights": [
        "Architected a workflow to enable data center technicians to audit fiber data with over $4 million in potential operational savings.",
        "Seamlessly integrated a React-powered file upload widget into an AWS internal workflow engine, enhancing customer experience by ingesting data in a standard CSV format.",
        "Modeled 2,400 link hierarchies in an integration between two teams, which creates leased optic fiber data in an Amazon-owned database.",
        "Designed new features for an AWS Networking database that serves as the source of truth for 1.9 million network links worldwide.",
        "Influenced the team's weekly operational review process by implementing automated ticket statistics, saving 30+ minutes per week of manual analysis."
      ],
      "endDate": "Sep 2024"
    },
    {
      "highlights": [
        "Planned and executed the delivery of the CoreXM Dashboards 'table-of-contents,' enhancing navigation efficiency for over 10,000 active brands.",
        "Reduced legacy customer data deletion KTLO by 100% by crafting a scheduled cleanup package.",
        "Collaborated with product and UX research teams to urgently improve dashboard adoption by enhancing page visibility across four types of dashboards.",
        "Drove the deprecation of a vulnerable service, reducing active customer brands from over 500 to 12.",
        "Reduced on-call vulnerability ticket triage time by 100% through triaging automation and automatic patch version updates.",
        "Created a central golden signals operational dashboard, reducing incident triage time by about 40%.",
        "Optimized integration tests, reducing runtime by 30% and boosting the pass rate to over 90% by scaling the authentication process to a constant-time operation."
      ],
      "company": "Qualtrics",
      "position": "Software Engineer II",
      "location": "Seattle, WA",
      "startDate": "Oct 2022",
      "endDate": "Mar 2024"
    },
    {
      "highlights": [
        "Spearheaded the development of 'Custom Metrics' in a report editor, allowing customers to compute 30 equations composed of up to 10 individual survey metrics.",
        "Improved data deletion efficiency from about three hours to 15 minutes per week with partial automation.",
        "Mentored a full-time engineer and an intern to full independence within one quarter."
      ],
      "company": "Qualtrics",
      "position": "Software Engineer I",
      "location": "Seattle, WA",
      "endDate": "Oct 2022",
      "startDate": "Jan 2021"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": [
        "TypeScript, JavaScript, Java, Python, HTML, CSS, Scala"
      ]
    },
    {
      "keywords": [
        "AWS CDK, React, Express, GraphQL, AngularJS, jQuery"
      ],
      "name": "Frameworks and Libraries"
    },
    {
      "keywords": [
        "Git, NodeJS, NPM, Jenkins, Gradle, Postman, Webpack, Bazel"
      ],
      "name": "Developer Tooling"
    },
    {
      "keywords": [
        "Docker, CloudWatch, EC2, Nomad, Splunk, Grafana, Amplitude"
      ],
      "name": "Cloud and Infrastructure"
    },
    {
      "keywords": [
        "Lambda, SQS, SNS, Redis, Glue, API Gateway, LakeFormation"
      ],
      "name": "Distributed Systems"
    },
    {
      "keywords": [
        "S3, DynamoDB, Athena, RDS, MongoDB"
      ],
      "name": "Databases"
    },
    {
      "keywords": [
        "JUnit, Mockito, Mocha, Chai, Sinon, Jest, Karma, Selenium"
      ],
      "name": "Testing Libraries"
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills"
  ]
}